# Пользователь вводит время в секундах.
# Переведите время в часы, минуты, секунды и выведите в формате чч:мм:сс.
# Используйте форматирование строк.

time = int(input('Сколько секунд? '))
Hours = time // 3600
Minutes = (time - Hours * 3600) // 60
Seconds = time - (Hours * 3600 + Minutes * 60)

print (f"ЧЧ:ММ:СС {Hours} : {Minutes} : {Seconds}")






